OpenFOAM/WFD_OpenFOAM/templates/prop_MRF_template_snappy_backup/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    propeller
    {
        type        triSurface;
        file        "../triSurface/propeller.stl";
        name        propeller;
    }

    propellerRefinementBox
    {
        type        box;
        min         (-0.13 -0.13 -0.08);
        max         ( 0.13  0.13  0.08);
    }
};

castellatedMeshControls
{
    maxLocalCells       100000;
    maxGlobalCells      1500000;
    minRefinementCells  0;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features
    (
        {
            file        "propeller.extendedFeatureEdgeMesh";
            level       2;
        }
    );

    refinementSurfaces
    {
        propeller
        {
            level       (2 3);
            patchInfo
            {
                type    wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        propellerRefinementBox
        {
            mode        inside;
            level       2;
        }
    }

    // OpenFOAM 13 tutorials use insidePoint for the kept mesh region.
    insidePoint (0.2 0.2 0.2);

    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 3;
    tolerance    2.0;
    nSolveIter   100;
    nRelaxIter   5;

    nFeatureSnapIter     10;
    implicitFeatureSnap  false;
    explicitFeatureSnap  true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio          1.0;
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        15;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              -1e30;
    minTetQuality       -1;
    minTwist            0.01;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        maxNonOrtho     75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
